<template>
    <div class="heapage">
        <el-page-header @back="goBack" content="人类红细胞血型抗原" style="margin-bottom: 30px">
        </el-page-header>
        <h2>红细胞血型抗原</h2>
        <div v-for="(item, index) in article" :key="'article'+index">
            <h3>{{ item.title }}</h3>
            <p v-for="(p, index) in item.list" :key="'p'+index">{{ p }}</p>
        </div>
    </div>
</template>

<script>
export default {
    name: 'heaPage',
    data(){
        return {
            article: [
                {
                    title: '一、红细胞血型抗原的生物化学性质',
                    list: [
                        '研究红细胞血型首先要了解红细胞血型抗原是什么，它是如何产生的、有何特点。红细胞血型抗原的产生与细胞膜的结构紧密相关，红细胞膜是由双分子磷脂层构成的液态镶嵌膜。脂质双分子层主要有磷脂、胆固醇和糖脂组成，厚度约为4~5nm。红细胞膜可以耐受大幅度变形，可以达到微循环末端，将氧运输到组织器官。镶嵌于双层磷脂骨架中的蛋白质被称为整合蛋白，其疏水部分位于脂质双层内部，亲水部分位于脂质双层外部。由于存在疏水结构域，整合蛋白与膜的结合非常紧密，只有用表面活性剂、有机溶剂破坏细胞膜的双分子磷脂层结构后才能将其提取出来。有些整合蛋白可以多次跨越细胞膜双层磷脂骨架结构，线性跨膜区与双层磷脂可紧密地结合在一起。比如，RhD蛋白可跨越细胞膜12此，Duffy血型蛋白可跨越7次。整合蛋白地生物学功能之一就是维持细胞膜磷脂层估计结构地稳定性，由于它本身是蛋白质，具有抗原性，奠定了形成红细胞血型地物质基础。',
                        '从生物化学地角度看，构成红细胞膜的脂质和蛋白质都可以通过化学键与糖分子结合。例如，通过糖脂键形成糖脂，通过N-连接或O-连接形成糖蛋白（糖分子与多肽链的天冬氨酸的NH2自由基连接称为N-连接。糖分子与多肽链的丝氨酸、苏氨酸或羟赖氨酸羟基中的氧原子连接称为O-连接）。结合到细胞膜上的由多个单糖分子构成的糖链都是伸出到细胞外液的，而糖链结构同样具有抗原性，是形成红细胞血型的另一种重要物质。糖链作为膜结构的重要组成部分有其独特的生物学功能，在分子间识别、黏附、趋化等过程中起着桥梁作用。对于糖蛋白来讲，其生物学功能主要由蛋白质来承担，糖链结构主要起着稳定蛋白质的立体结构，保持蛋白质的生物学活性及抗原性的作用。而糖蛋白的抗原性由蛋白质决定还是由糖链结构决定关键取决于糖分子与蛋白质结合的位点在糖蛋白三维构象中所处的位置。有些糖链与蛋白质结合后只起到维持蛋白质结构稳定的作用，而与临床通常意义上的红细胞血型无关。如Duffy血型抗原是一种糖蛋白，但其抗原性却取决于蛋白质结构而非糖链结构。',
                        '总之，形成红细胞血型抗原的物质基础是红细胞膜上的蛋白质及结合到脂质和蛋白质上的糖分子。根据生化特性的不同，红细胞血型抗原可以分为两类，一类是由糖分子结构决定的血型抗原，如ABO、Hh、Lewis、P、I等血型。另一类是由蛋白质结构决定的血型抗原，如Rh、MNS、Kell、Kidd、JK等血型。'
                    ]
                },
                {
                    title: '二、红细胞血型抗原的分布',
                    list: [
                        '从生物化学角度看，只要由蛋白质和脂质的地方就有可能结合糖分子，所以由糖分子决定的红细胞血型抗原分布极广，可分布在人体除中枢神经细胞外的各种组织细胞、体液和分泌液中，所以又称作组织血型（histo-blood group）。血型不仅在输血中具有重要的临床意义，而且在器官移植等方面也具有重要的临床意义。为区分分布在组织细胞与体液中的红细胞血型抗原，通常将分布在体液中的可溶性红细胞血型抗原称为血型物质（bloodgroup substance）。血型物质与位于红细胞表面的抗原既有联系又有区别。可溶性血型物质包括由红细胞自身合成的以及由非红细胞合成的糖类血型抗原，如存在于血浆中的Lewis、Chid/Rodgers血型物质并非由红细胞合成。位于红细胞表面的血型抗原大部分由红细胞合成，小部分是从血浆中的血型物质中吸附而来，如红细胞将血浆中的Lewis、Chid/Rodgers血型物质吸附到细胞表面后便可使红细胞表现出相应的抗原特性。',
                        '相比之下，蛋白质类抗原的分布不如糖类抗原广泛，这与系统发生有关。红细胞蛋白质类抗原绝大多数分布在红细胞或骨髓造血干细胞来源的血细胞上，所以它又被称为器官血型（organic-blood group）。比如，Rh血型抗原只存在于红细胞表面，是红细胞专属抗原。',
                        '图1-4和表1-6所示为分布在人体器官表面的主要血型系统。有观点认为输血也是一种细胞移植或细胞治疗，这对血型抗原的检测和鉴定水平提出了更高的要求。'
                    ]
                },
                {
                    title: '三、红细胞血型基因与抗原的表达',
                    list: [
                        '红细胞血型抗原的表达受基因控制，基因表达的主要产物是蛋白质，所以蛋白质类红细胞血型抗原的合成与表达受基因的直接控制。糖类抗原的合成与表达受糖基转移酶的调控，而糖基转移酶的合成又受基因的控制，所以基因是通过间接方式来调控糖类抗原的表达。',
                        '基因与蛋白表达的调控非常复杂，主要涉及以下几个方面：转录水平的调控、mRNA水平的调控及蛋白质翻译水平的调控。蛋白质的表达普遍遵循着这样一条原则，即有相应的基因就有可能表达出相应的蛋白质。蛋白质是否表达不仅取决于基因是否存在，同时还受其他因素的影响。若没有相应的基因，则不会表达出相应的蛋白质。',
                        '与蛋白质的表达相比，糖类抗原的表达更加复杂，不仅受基因的间接调控而且还受底物的制约。底物是参与生化反应的物质，在酶的作用下可形成相应的产物，一个生化反应的产物往往同时又是另一个生化反应的底物。底物的这一特点在红细胞糖类血型抗原的合成过程中表现非常明显。红细胞糖类抗原的合成过程是酶促生物化学反应过程，一种新抗原的合成往往是以另一种抗原为底物。例如，以Ii血型糖链结构为底物，在α-1,2-L-岩藻糖基转移酶（α-1,2-L-fucosyltransferase，简称H转移酶，或H酶）催化合成H抗原。以H抗原为底物在α-1,3-N-乙酰基半乳糖氨基转移酶（α-1,3-N-acetylgalactosaminyltransferase，简称A转移酶，或A酶）、α-1,3-D-半乳糖基转移酶（α-1,3-D-galactosyltransferase，简称B转移酶，或B酶）催化下可分别合成A、B抗原。若作为底物的抗原不存在，即使有相应的糖基转移酶也无法合成相应的抗原。例如，孟买型个体即使ABO基因能合成功能正常的A或B转移酶也无法合成A或B抗原，因为作为反应底物的H抗原不存在，这也是孟买血型为什么会表达高水平Ii血型抗原的原因。糖链分子的生化合成特性赋予了红细胞血型糖类抗原许多蛋白质类抗原所不具备的性质。'
                    ]
                },
                {
                    title: '四、红细胞血型抗原的临床意义',
                    list: [
                        '临床输血治疗实践中会出现由于红细胞血型不合而引起溶血性贫血、肾功能衰竭、休克甚至死亡等输血不良反应。临床上，将能引起输血不良反应的红细胞血型称为具有临床意义的红细胞血型。临床意义指的是对疾病诊断的判断依据和价值，它可以来自回顾性统计分析，也可以来自临床观察。根据已有的文献报道，具有临床意义的红细胞血型主要有：ABO、Rh、Duffy、Kidd、MNS、P、Lewis、Kell等血型系统，在这些血型系统中都有发现有导致输血反应的抗体。',
                        '红细胞血型的抗原分布频率与人种、地域等因素有关。比如，Kell血型系统中，高加索人中约9%为K抗原阳性，阿拉伯人中约为25%为K抗原阳性，而黑人中只有2%为K抗原阳性。所以，红细胞血型的临床意义是个相对概念，有临床意义显著或不显著之分。红细胞血型的临床意义是否显著，需从多方面进行评价，例如，某一特定区域、特定人种、特定红细胞血型的表现频率，产生相应抗体的频率以及由相应抗体引起临床症状的严重程度等。',
                        '某些具有临床意义的血型在特定区域总人口中所占比例非常低，例如孟买型，其临床意义远没有常见的ABO及Rh血型系统重要，但同样会引起严重的输血不良反应。有条件的地区应开展稀有血型的检测，建立稀有血型血液实体库及稀有血型供者资料库，以保障稀有血型患者的用血需求。'
                    ]
                }
            ]
        }
    },
    methods: {
        goBack(){
            this.$router.push('/page4')
        }
    }
}
</script>

<style lang='scss' scoped>
.heapage{ 
    width: 1000px;
    margin: 0 auto;
    p{
        font-size: 16px;
        margin-bottom: 10px;
        line-height: 25px;
        padding: 10px;
        text-indent: 35px;
    }
    h2{
        margin-bottom: 20px;
    }
}
</style>